# Offset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailInfo..::..Offset Property
NonContinuousRailInfo Class See Also
---
The side offset of the non-continuous rail from a [!:Autodesk::Revit::DB::Architecture::Railing] from the railing center.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public double Offset { get; set; }
```

Visual Basic
---
```text
Public Property Offset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Offset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for offset must be no more than 30000 feet in absolute value. |

# See Also
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace